FOR INSTALLING PYSPARK

In [ ]:
!pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.3.tar.gz (317.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 317.3/317.3 MB 1.6 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.3-py2.py3-none-any.whl size=317840625 sha256=ea34d9675100e085b7d125f49ccbd9e55d8021e8c1b3e850e1f15bcd1a1a6f45
  Stored in directory: /root/.cache/pip/wheels/1b/3a/92/28b93e2fbfdbb07509ca4d6f50c5e407f48dce4ddbda69a4ab
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.5.3

IMPORT'S FOR THE CODE

In [ ]:
import pyspark
import pandas as pd
from pyspark.sql import SparkSession    #For creating a sparksession to perform task

READING TEH CSV FILE WHICH YOU HAVE CREATED

In [ ]:
pd.read_csv('/content/sample_data/employees.csv')

              Name  Age  Experience  Salary
0      Alice Smith   28           5   60000
1      Bob Johnson   35          10   85000
2    Charlie Brown   22           1   45000
3      Diana White   30           7   70000
4      Ethan Clark   40          15   95000
5      Fiona Green   27           3   55000
6    George Harris   50          20  120000
7       Hannah Lee   29           6   65000
8       Ian Walker   33          12   80000
9      Julia Adams   25           4   48000
10    Kevin Martin   38           9   72000
11  Laura Thompson   31           8   78000
12    Michael King   45          18  110000
13      Nina Scott   26           2   50000
14    Oscar Turner   37          14   90000
15     Paula Allen   34          11   82000

In [ ]:
#Start session
spark = SparkSession.builder.appName('Practice').getOrCreate()

#Read dataset and store in variable
df_pyspark = spark.read.option('header','true').csv('/content/sample_data/employees.csv')
df_pyspark.show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark = spark.read.csv('/content/sample_data/employees.csv', header = True, inferSchema = True)

In [ ]:
spark.read.option('header','true').csv('/content/sample_data/employees.csv', inferSchema = True)

DataFrame[Name: string, Age: int, Experience: int, Salary: int]

In [ ]:
#Type of the data
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [ ]:
#Check Schema
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [ ]:
#First 3 data values
df_pyspark.head(3)

[Row(Name='Alice Smith', Age=28, Experience=5, Salary=60000),
 Row(Name='Bob Johnson', Age=35, Experience=10, Salary=85000),
 Row(Name='Charlie Brown', Age=22, Experience=1, Salary=45000)]

In [ ]:
#to get name of teh columns
df_pyspark.columns

['Name', 'Age', 'Experience', 'Salary']

In [ ]:
#selecting specific columns in the output
df_pyspark.select('Name').show()
df_pyspark.select(['Name','Experience']).show()

+--------------+
|          Name|
+--------------+
|   Alice Smith|
|   Bob Johnson|
| Charlie Brown|
|   Diana White|
|   Ethan Clark|
|   Fiona Green|
| George Harris|
|    Hannah Lee|
|    Ian Walker|
|   Julia Adams|
|  Kevin Martin|
|Laura Thompson|
|  Michael King|
|    Nina Scott|
|  Oscar Turner|
|   Paula Allen|
+--------------+

+--------------+----------+
|          Name|Experience|
+--------------+----------+
|   Alice Smith|         5|
|   Bob Johnson|        10|
| Charlie Brown|         1|
|   Diana White|         7|
|   Ethan Clark|        15|
|   Fiona Green|         3|
| George Harris|        20|
|    Hannah Lee|         6|
|    Ian Walker|        12|
|   Julia Adams|         4|
|  Kevin Martin|         9|
|Laura Thompson|         8|
|  Michael King|        18|
|    Nina Scott|         2|
|  Oscar Turner|        14|
|   Paula Allen|        11|
+--------------+----------+

In [ ]:
#to check datatypes
df_pyspark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Experience', 'int'), ('Salary', 'int')]

In [ ]:
#to describe the dataset
df_pyspark.describe().show()

+-------+-----------+-----------------+------------------+------------------+
|summary|       Name|              Age|        Experience|            Salary|
+-------+-----------+-----------------+------------------+------------------+
|  count|         16|               16|                16|                16|
|   mean|       NULL|           33.125|            9.0625|           75312.5|
| stddev|       NULL|7.535471672916921|5.6623758264530615|21709.348984558088|
|    min|Alice Smith|               22|                 1|             45000|
|    max|Paula Allen|               50|                20|            120000|
+-------+-----------+-----------------+------------------+------------------+

In [ ]:
#adding column in teh data frame
df_pyspark = df_pyspark.withColumn('Experience After 2 years', df_pyspark['Experience']+2)
df_pyspark.show()

+--------------+---+----------+------+------------------------+
|          Name|Age|Experience|Salary|Experience After 2 years|
+--------------+---+----------+------+------------------------+
|   Alice Smith| 28|         5| 60000|                       7|
|   Bob Johnson| 35|        10| 85000|                      12|
| Charlie Brown| 22|         1| 45000|                       3|
|   Diana White| 30|         7| 70000|                       9|
|   Ethan Clark| 40|        15| 95000|                      17|
|   Fiona Green| 27|         3| 55000|                       5|
| George Harris| 50|        20|120000|                      22|
|    Hannah Lee| 29|         6| 65000|                       8|
|    Ian Walker| 33|        12| 80000|                      14|
|   Julia Adams| 25|         4| 48000|                       6|
|  Kevin Martin| 38|         9| 72000|                      11|
|Laura Thompson| 31|         8| 78000|                      10|
|  Michael King| 45|        18|110000|                      20|
|    Nina Scott| 26|         2| 50000|                       4|
|  Oscar Turner| 37|        14| 90000|                      16|
|   Paula Allen| 34|        11| 82000|                      13|
+--------------+---+----------+------+------------------------+

In [ ]:
#drop the columns
df_pyspark = df_pyspark.drop('Experience After 2 years')
df_pyspark.show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

Modifying the CSV files content

In [ ]:
#rename the columns
df_pyspark.withColumnRenamed('Name','New Name')
df_pyspark.show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark.na.drop().show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
#any==how
df_pyspark.na.drop(how="all").show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark.na.drop(how="any").show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark.na.drop(how="any", thresh = 2).show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark.na.drop(how="any", subset = ['Experience']).show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
#filling the missing value
df_pyspark.na.fill('Missing Values').show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
df_pyspark.na.fill('Missing Values',['Experience','Age']).show()

+--------------+---+----------+------+
|          Name|Age|Experience|Salary|
+--------------+---+----------+------+
|   Alice Smith| 28|         5| 60000|
|   Bob Johnson| 35|        10| 85000|
| Charlie Brown| 22|         1| 45000|
|   Diana White| 30|         7| 70000|
|   Ethan Clark| 40|        15| 95000|
|   Fiona Green| 27|         3| 55000|
| George Harris| 50|        20|120000|
|    Hannah Lee| 29|         6| 65000|
|    Ian Walker| 33|        12| 80000|
|   Julia Adams| 25|         4| 48000|
|  Kevin Martin| 38|         9| 72000|
|Laura Thompson| 31|         8| 78000|
|  Michael King| 45|        18|110000|
|    Nina Scott| 26|         2| 50000|
|  Oscar Turner| 37|        14| 90000|
|   Paula Allen| 34|        11| 82000|
+--------------+---+----------+------+

In [ ]:
#writing the function to calculate the value at the place of null
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols = ['Age','Experience','Salary'],
    outputCols = ["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
).setStrategy("mean")

In [ ]:
#add imputation columns to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+--------------+---+----------+------+-----------+------------------+--------------+
|          Name|Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+--------------+---+----------+------+-----------+------------------+--------------+
|   Alice Smith| 28|         5| 60000|         28|                 5|         60000|
|   Bob Johnson| 35|        10| 85000|         35|                10|         85000|
| Charlie Brown| 22|         1| 45000|         22|                 1|         45000|
|   Diana White| 30|         7| 70000|         30|                 7|         70000|
|   Ethan Clark| 40|        15| 95000|         40|                15|         95000|
|   Fiona Green| 27|         3| 55000|         27|                 3|         55000|
| George Harris| 50|        20|120000|         50|                20|        120000|
|    Hannah Lee| 29|         6| 65000|         29|                 6|         65000|
|    Ian Walker| 33|        12| 80000|         33|                12|         80000|
|   Julia Adams| 25|         4| 48000|         25|                 4|         48000|
|  Kevin Martin| 38|         9| 72000|         38|                 9|         72000|
|Laura Thompson| 31|         8| 78000|         31|                 8|         78000|
|  Michael King| 45|        18|110000|         45|                18|        110000|
|    Nina Scott| 26|         2| 50000|         26|                 2|         50000|
|  Oscar Turner| 37|        14| 90000|         37|                14|         90000|
|   Paula Allen| 34|        11| 82000|         34|                11|         82000|
+--------------+---+----------+------+-----------+------------------+--------------+